zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp251cxx_cm0.h
/*****************  Bit definition for GPIO_SEMCR6 register  ******************/
#define GPIO_SEMCR6_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR6_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR6_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR6_SEM_MUTEX          GPIO_SEMCR6_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR6_SEMCID_Pos         (4U)
#define GPIO_SEMCR6_SEMCID_Msk         (0x3UL << GPIO_SEMCR6_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR6_SEMCID             GPIO_SEMCR6_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR7 register  *****************/
#define GPIO_CIDCFGR7_CFEN_Pos         (0U)
#define GPIO_CIDCFGR7_CFEN_Msk         (0x1UL << GPIO_CIDCFGR7_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR7_CFEN             GPIO_CIDCFGR7_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR7_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR7_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR7_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR7_SEM_EN           GPIO_CIDCFGR7_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR7_SCID_Pos         (4U)
#define GPIO_CIDCFGR7_SCID_Msk         (0x3UL << GPIO_CIDCFGR7_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR7_SCID             GPIO_CIDCFGR7_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR7_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR7_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR7_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR7_SEMWLC0          GPIO_CIDCFGR7_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR7_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR7_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR7_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR7_SEMWLC1          GPIO_CIDCFGR7_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR7_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR7_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR7_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR7_SEMWLC2          GPIO_CIDCFGR7_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR7_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR7_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR7_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR7_SEMWLC3          GPIO_CIDCFGR7_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR7 register  ******************/
#define GPIO_SEMCR7_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR7_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR7_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR7_SEM_MUTEX          GPIO_SEMCR7_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR7_SEMCID_Pos         (4U)
#define GPIO_SEMCR7_SEMCID_Msk         (0x3UL << GPIO_SEMCR7_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR7_SEMCID             GPIO_SEMCR7_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR8 register  *****************/
#define GPIO_CIDCFGR8_CFEN_Pos         (0U)
#define GPIO_CIDCFGR8_CFEN_Msk         (0x1UL << GPIO_CIDCFGR8_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR8_CFEN             GPIO_CIDCFGR8_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR8_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR8_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR8_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR8_SEM_EN           GPIO_CIDCFGR8_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR8_SCID_Pos         (4U)
#define GPIO_CIDCFGR8_SCID_Msk         (0x3UL << GPIO_CIDCFGR8_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR8_SCID             GPIO_CIDCFGR8_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR8_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR8_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR8_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR8_SEMWLC0          GPIO_CIDCFGR8_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR8_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR8_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR8_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR8_SEMWLC1          GPIO_CIDCFGR8_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR8_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR8_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR8_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR8_SEMWLC2          GPIO_CIDCFGR8_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR8_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR8_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR8_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR8_SEMWLC3          GPIO_CIDCFGR8_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR8 register  ******************/
#define GPIO_SEMCR8_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR8_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR8_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR8_SEM_MUTEX          GPIO_SEMCR8_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR8_SEMCID_Pos         (4U)
#define GPIO_SEMCR8_SEMCID_Msk         (0x3UL << GPIO_SEMCR8_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR8_SEMCID             GPIO_SEMCR8_SEMCID_Msk                   /*!< Semaphore current CID */

/****************  Bit definition for GPIO_CIDCFGR9 register  *****************/
#define GPIO_CIDCFGR9_CFEN_Pos         (0U)
#define GPIO_CIDCFGR9_CFEN_Msk         (0x1UL << GPIO_CIDCFGR9_CFEN_Pos)         /*!< 0x00000001 */
#define GPIO_CIDCFGR9_CFEN             GPIO_CIDCFGR9_CFEN_Msk                   /*!< CID filtering enable */
#define GPIO_CIDCFGR9_SEM_EN_Pos       (1U)
#define GPIO_CIDCFGR9_SEM_EN_Msk       (0x1UL << GPIO_CIDCFGR9_SEM_EN_Pos)       /*!< 0x00000002 */
#define GPIO_CIDCFGR9_SEM_EN           GPIO_CIDCFGR9_SEM_EN_Msk                 /*!< Semaphore enable */
#define GPIO_CIDCFGR9_SCID_Pos         (4U)
#define GPIO_CIDCFGR9_SCID_Msk         (0x3UL << GPIO_CIDCFGR9_SCID_Pos)         /*!< 0x00000030 */
#define GPIO_CIDCFGR9_SCID             GPIO_CIDCFGR9_SCID_Msk                   /*!< Static CID */
#define GPIO_CIDCFGR9_SEMWLC0_Pos      (16U)
#define GPIO_CIDCFGR9_SEMWLC0_Msk      (0x1UL << GPIO_CIDCFGR9_SEMWLC0_Pos)      /*!< 0x00010000 */
#define GPIO_CIDCFGR9_SEMWLC0          GPIO_CIDCFGR9_SEMWLC0_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR9_SEMWLC1_Pos      (17U)
#define GPIO_CIDCFGR9_SEMWLC1_Msk      (0x1UL << GPIO_CIDCFGR9_SEMWLC1_Pos)      /*!< 0x00020000 */
#define GPIO_CIDCFGR9_SEMWLC1          GPIO_CIDCFGR9_SEMWLC1_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR9_SEMWLC2_Pos      (18U)
#define GPIO_CIDCFGR9_SEMWLC2_Msk      (0x1UL << GPIO_CIDCFGR9_SEMWLC2_Pos)      /*!< 0x00040000 */
#define GPIO_CIDCFGR9_SEMWLC2          GPIO_CIDCFGR9_SEMWLC2_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */
#define GPIO_CIDCFGR9_SEMWLC3_Pos      (19U)
#define GPIO_CIDCFGR9_SEMWLC3_Msk      (0x1UL << GPIO_CIDCFGR9_SEMWLC3_Pos)      /*!< 0x00080000 */
#define GPIO_CIDCFGR9_SEMWLC3          GPIO_CIDCFGR9_SEMWLC3_Msk                /*!< Semaphore whitelist for compartment y (y=0 to 3) */

/*****************  Bit definition for GPIO_SEMCR9 register  ******************/
#define GPIO_SEMCR9_SEM_MUTEX_Pos      (0U)
#define GPIO_SEMCR9_SEM_MUTEX_Msk      (0x1UL << GPIO_SEMCR9_SEM_MUTEX_Pos)      /*!< 0x00000001 */
#define GPIO_SEMCR9_SEM_MUTEX          GPIO_SEMCR9_SEM_MUTEX_Msk                /*!< Semaphore Mutex */
#define GPIO_SEMCR9_SEMCID_Pos         (4U)
#define GPIO_SEMCR9_SEMCID_Msk         (0x3UL << GPIO_SEMCR9_SEMCID_Pos)         /*!< 0x00000030 */
#define GPIO_SEMCR9_SEMCID             GPIO_SEMCR9_SEMCID_Msk                   /*!< Semaphore current CID */

